In [2]:
class Counter:
    def __init__(self, count_value):
        self.count_vlaue = count_value

    def increment(self):
        self.count_vlaue += 1

    def get_count(self):
        return self.count_vlaue 

counter1 = Counter(500)
counter2 = Counter(1000)

counter1.increment()
counter2.increment()
print(counter2.get_count())
print(counter1.get_count())

1001
501

In [7]:
class Animal:
    def __init__(self, eat, name):
        self.name = name
        self.eat = eat

    def eat(self):
            print(f"{self.name} is eating")

    def sleep(self):
            print(f"{self.name} is sleeping")

class Dog(Animal):
    def bark(self):
        print(f"Dog saya {self.name}")

class Cat(Animal):
    def meow(self):
        print(f"Cat say meow{self.name}")    

animal_behaviour = Dog(32, "Dogesh Bhai")
animal_behaviour2 = Cat(12, "pinky")

animal_behaviour.bark()
animal_behaviour2.meow()
animal_behaviour.sleep()

Dog saya Dogesh Bhai
Cat say meowpinky
Dogesh Bhai is sleeping

In [8]:
import pandas as pd

data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'Salary': [50000, 60000, 45000, 55000, 70000, 80000],
    'Bonus': [2000, 3000, 1000, 1500, 5000, 6000]

}
df = pd.DataFrame(data)
print(df)

  Department  Salary  Bonus
0      Sales   50000   2000
1      Sales   60000   3000
2         HR   45000   1000
3         HR   55000   1500
4         IT   70000   5000
5         IT   80000   6000

In [10]:
df.groupby("Department").agg(
    sum_totalsalary = ("Salary", "sum"),
    Average_Bonus = ("Bonus", "mean")
)

            sum_totalsalary  Average_Bonus
Department
HR                   100000         1250.0
IT                   150000         5500.0
Sales                110000         2500.0

In [16]:
def square(x):
    return x**2

square_lamda = lambda x : x**2
print(square_lamda(5))   

pair = [(1, 'one'), (3, 'three'), (2, 'two')]
pair.sort(key=lambda x: x[1]) #sort by string
print(pair)

25
[(1, 'one'), (3, 'three'), (2, 'two')]

In [20]:
from functools import reduce


number = [1, 2, 3, 4, 5, 6, 7, 8]

#Map square every number
squared_number = list(map(lambda x : x**2, number))
print(squared_number)

# Filter: keep even numbers
Filtered_numbers = list(filter(lambda x : x % 2 == 0, number))
print(Filtered_numbers)

# Reduce: product of all numbers
reduced_numbers = reduce(lambda x, y : x * y, number)
reduced_numbers

[1, 4, 9, 16, 25, 36, 49, 64]
[2, 4, 6, 8]

40320

In [25]:
df = pd.DataFrame(
    {
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Income': [50000, 6000, 70000],
        'Department': ['IT', 'HR', 'IT']
    }
)

df['Dep_code'] = df['Department'].map({'IT' : 2, 'HR' : 1})
df
df['income_code'] = df["Income"].map({50000:1, 6000:2, 70000:3})
df

      Name  Income Department  Dep_code  income_code
0    Alice   50000         IT         2            1
1      Bob    6000         HR         1            2
2  Charlie   70000         IT         2            3

In [28]:
data = [10, 12, 11, 13, 12, 14, 15, 100]

df = pd.DataFrame({"Value":data})
df

   Value
0     10
1     12
2     11
3     13
4     12
5     14
6     15
7    100

## Formula for IQR
## IQR = Q3 − Q1

## Lower = Q1 − 1.5*IQR
## Upper = Q3 + 1.5*IQR

In [31]:
Q1 = df["Value"].quantile(0.25)
Q3 = df["Value"].quantile(0.75)

IQR = Q3 - Q1

lower = Q1 - 1.5 * IQR
upper = Q3 + 1.5 * IQR

outliner = df[(df["Value"] < lower) | (df["Value"] > upper)]
print(outliner)

   Value
7    100

In [32]:
import pandas as pd

data = {
    "name": ["Surya", "Vamsi", "Jyothi", "Srinivas"],
    "Salary": [6000, 3000, 4000, 5000],
    "Age": [27, 28, 29, 30]
}

df = pd.DataFrame(data)
print(df)

       name  Salary  Age
0     Surya    6000   27
1     Vamsi    3000   28
2    Jyothi    4000   29
3  Srinivas    5000   30

In [35]:
df['name'] #Single column
df[["name", "Salary"]] #Multiple column

       name  Salary
0     Surya    6000
1     Vamsi    3000
2    Jyothi    4000
3  Srinivas    5000

In [ ]:
df.loc[1] #loc is belongs to Row access

name      Vamsi
Salary     3000
Age          28
Name: 1, dtype: object

In [41]:
df.loc[2, "Salary"]

np.int64(4000)

In [ ]:
df.loc[0:2] #Range

     name  Salary  Age
0   Surya    6000   27
1   Vamsi    3000   28
2  Jyothi    4000   29

In [43]:
df.loc[df["Salary"] > 3000]

       name  Salary  Age
0     Surya    6000   27
2    Jyothi    4000   29
3  Srinivas    5000   30

In [44]:
#.iloc["row_position", "column_position"]
df.iloc[1]

name      Vamsi
Salary     3000
Age          28
Name: 1, dtype: object

In [48]:
df.iloc[0, 2]

np.int64(27)

In [49]:
df[df['Age'] > 23]

       name  Salary  Age
0     Surya    6000   27
1     Vamsi    3000   28
2    Jyothi    4000   29
3  Srinivas    5000   30

In [50]:
df[(df["Salary"] > 3000) & (df["Age"] > 27)]

       name  Salary  Age
2    Jyothi    4000   29
3  Srinivas    5000   30

In [51]:
df[(df["Salary"] > 3000) | (df["Age"] > 25)]

       name  Salary  Age
0     Surya    6000   27
1     Vamsi    3000   28
2    Jyothi    4000   29
3  Srinivas    5000   30

In [53]:
df["Bonus"] = df["Salary"] * 2
df

       name  Salary  Age  Bonus
0     Surya    6000   27  12000
1     Vamsi    3000   28   6000
2    Jyothi    4000   29   8000
3  Srinivas    5000   30  10000